
class Texts:
    def invite(link, ref):
        invite_friends = (
            f"Баланс: 0\nПриглашенных друзей: {ref}\n"
            "Правила: За каждого друга оплатившего подписку - 50% от суммы подписки.\n"
            "За каждых 10 друзей (не важно с подпиской или нет) - Ваучер от 50₽ до 5.000₽\n\n"
            "Баланс вы можете использовать для продление подписки, либо вывести на карту своего банка.\n"
            "Минимальная сумма вывода от 5.000₽\n\n"
            f"Ваша реферальная ссылка:\n{link}")
        return invite_friends
    

    text_greeting = (
    "Добро пожаловать 👋\n\n"
    "Я твой личный помощник по самой нашумевшей игре в интернете - «Rocket Queen»\n\n"
    "🤖 Моя главная задача - увеличить твой баланс.\n\n"
    "🤖 Я ежесекундно анализирую игровое поле и даю тебе четкие сигналы с помощью которых твой доход стабильно растет\n\n"
    "🤖 Точность моих сигналов - 92% но с каждым днем, я становлюсь лучше."
    )

    # text_greeting_j = "".join(text_greeting)

    get_5k_text = (
        "После регистрации на сайте 1win (ссылка на сайт) в разделе: «Free money» за установку приложения 1win на свой телефон,"
        "компания 1win своим новым игрокам дарит 5.000₽ на игровой счет.\n\n"
        "А так же за выполнения других условий, вы можете получить 1win coins, которые так же можно обменять на деньги. "
    )

    #После нажатия на кнопку: «подробней об игре» - 
    second_text = (
        "Суть игры заключается в следующем: вы ставите любую сумму 💸 и ракета взлетает,"
        "с каждой секундой полета сумма вашего выигрыша увеличивается, но есть одно НО❗️"
        "Вы должны успеть забрать свой выигрыш до того, как ракета завершит свой полет.\n\n"
        "P.S. Ракета может завершить полет в любую секунду, чтобы успеть забрать,"
        "вы сами врятли сможете стабильно угадывать прогнозы полета, поэтому вам понадобится помощник"
        "😈Кто-то особенно умный, специально обученный и способный разбираться в технической стороне данной игры 😏\n\n"
        "🤖Наш бот как раз этим и займется. С помощью искусственного интеллекта и специальных"
        "алгоритмов он выдает сигналы, когда стоит ставить, а когда ход стоит пропустить"
        "и в какой момент вам стоит забрать свой выигрыш 🎁"
    )

    # После нажатия на кнопку: «получить сигнал» 
    third_text = (
        "Что бы продолжить важно зарегистрировать новый аккаунт на сайте 1win (ссылка в тексте)\n\n"
        "30.01.24 вышло обновление в работе сайта 1win, аккаунты зарегистрированные ранее имеют"
        "небольшую задержку - это может негативно сказаться при работе с ботом.\n\n"
        "Промокод: Robot100"
    )


    vauch_hand = "Пока нет доступных ваучеров. Для получения, приобретите подписку и пригласите 10 друзей"
    
    vauch_active = "Для получения, пригласите 10 друзей. Если будет набрано более 10 рефералов то ваучер появиться в данном меню"

    support = "Контакты технической-поддержки. Для того чтобы задать вопрос, нужно правильно изложить мысль"

    mines = ("Ссылка на наш канал, в котором будут обсуждаться проблемы и новости."
             "И конечно не обойдемся без конкурсов на подписку и бесплатных ваучеров"
    )
    
    instruc = (
        "🤖Бот по сигналам - 1winSignalBo\n\n"
        "Это сложный аналитический механизм работающий при поддержки искусственного"
        "интеллекта, который четко следует алгоритмам.\n\n\n"
        "Наша команда постоянно следит за качеством выдаваемых сигналов ботом."
        "А так же, мы ежедневно работает над его усовершенствованием.\n\n\n"
        "Во избежании некорректной получаемой информации (сигналов) на стороне наших активных пользователей,"
        "мы настоятельно рекомендуем вам выполнить все предписания указанные ниже.\n\n\n"
        "🚀Для более продуктивной работы рекомендуем вам завести новый аккаунт 1win (https://1wyodo.top/)\n\n"
        "30.01.24 вышло обновление в работе сайта 1win, аккаунты зарегистрированные"
        "ранее имеют небольшую задержку - это может негативно сказаться при работе с ботом.\n\n"
        "❌Для корректной работы бота отключите VPN\n\n"
        "🌏Найдите точку доступа со стабильным интернет соединением\n\n\n"
        "⁃ рекомендованная скорость интернета не ниже 30Mbps (для проверки скорости воспользуйтесь сервисом https://www.speedtest.net)\n\n"
        "🔇Не отключайте оповещение в боте, что бы не пропустить сигналы\n\n"
        "💸Не забывайте своевременно пополнять баланс на сайте 1Win\n\n"
        "Выполнив все предписания, вы гарантируете себе наилучшую работу с ботом по сигналам.\n\n"
        "Как работать с ботом?\n\n"
        "Сигналы в боте проходят ежедневно в 12:00 и 19:00 по МСК\n\n"
        "В назначенное время (12:00 и 19:00) все что вам нужно - это зайти в игру RocketQueen и следовать сигналам от бота.)\n\n"
    )